### Groupby

In [1]:
import pandas as pd

In [2]:
# data from
ipl_data = {
    "Team": [
        "Riders",
        "Riders",
        "Devils",
        "Devils",
        "Kings",
        "Kings",
        "Kings",
        "Kings",
        "Riders",
        "Royals",
        "Royals",
        "Riders",
    ],
    "Rank":[1,2,2,3,3,4,1,1,2,4,1,2],
    "Year":[2014, 2015,2014, 2015,2014, 2015,2016, 2017, 2016, 2014, 2015, 2015],
    "Point":[876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]
}

df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Point
0   Riders     1  2014    876
1   Riders     2  2015    789
2   Devils     2  2014    863
3   Devils     3  2015    673
4    Kings     3  2014    741
5    Kings     4  2015    812
6    Kings     1  2016    756
7    Kings     1  2017    788
8   Riders     2  2016    694
9   Royals     4  2014    701
10  Royals     1  2015    804
11  Riders     2  2015    690

In [3]:
df.groupby("Team")["Point"].std()

Team
Devils    134.350288
Kings      31.899582
Riders     88.567771
Royals     72.831998
Name: Point, dtype: float64

In [4]:
df.groupby("Team")["Point"].sum()

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Point, dtype: int64

In [5]:
df.groupby("Team")["Point"].mean()

Team
Devils    768.00
Kings     774.25
Riders    762.25
Royals    752.50
Name: Point, dtype: float64

In [6]:
# 한 개이상의 column을 묶을 수 있음
df.groupby(['Team', 'Year'])["Point"].sum()

Team    Year
Devils  2014     863
        2015     673
Kings   2014     741
        2015     812
        2016     756
        2017     788
Riders  2014     876
        2015    1479
        2016     694
Royals  2014     701
        2015     804
Name: Point, dtype: int64

In [8]:
# Hierarchical index
h_index = df.groupby(['Team', 'Year'])["Point"].sum()
h_index

Team    Year
Devils  2014     863
        2015     673
Kings   2014     741
        2015     812
        2016     756
        2017     788
Riders  2014     876
        2015    1479
        2016     694
Royals  2014     701
        2015     804
Name: Point, dtype: int64

In [9]:
h_index.index

MultiIndex([('Devils', 2014),
            ('Devils', 2015),
            ( 'Kings', 2014),
            ( 'Kings', 2015),
            ( 'Kings', 2016),
            ( 'Kings', 2017),
            ('Riders', 2014),
            ('Riders', 2015),
            ('Riders', 2016),
            ('Royals', 2014),
            ('Royals', 2015)],
           names=['Team', 'Year'])

In [11]:
h_index["Devils":"Kings"]

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2015    812
        2016    756
        2017    788
Name: Point, dtype: int64

In [12]:
h_index.unstack()

Year     2014    2015   2016   2017
Team
Devils  863.0   673.0    NaN    NaN
Kings   741.0   812.0  756.0  788.0
Riders  876.0  1479.0  694.0    NaN
Royals  701.0   804.0    NaN    NaN

In [13]:
h_index.unstack().stack()

Team    Year
Devils  2014     863.0
        2015     673.0
Kings   2014     741.0
        2015     812.0
        2016     756.0
        2017     788.0
Riders  2014     876.0
        2015    1479.0
        2016     694.0
Royals  2014     701.0
        2015     804.0
dtype: float64

In [14]:
h_index.reset_index()

      Team  Year  Point
0   Devils  2014    863
1   Devils  2015    673
2    Kings  2014    741
3    Kings  2015    812
4    Kings  2016    756
5    Kings  2017    788
6   Riders  2014    876
7   Riders  2015   1479
8   Riders  2016    694
9   Royals  2014    701
10  Royals  2015    804

In [15]:
h_index.swaplevel()

Year  Team
2014  Devils     863
2015  Devils     673
2014  Kings      741
2015  Kings      812
2016  Kings      756
2017  Kings      788
2014  Riders     876
2015  Riders    1479
2016  Riders     694
2014  Royals     701
2015  Royals     804
Name: Point, dtype: int64

In [17]:
h_index

Team    Year
Devils  2014     863
        2015     673
Kings   2014     741
        2015     812
        2016     756
        2017     788
Riders  2014     876
        2015    1479
        2016     694
Royals  2014     701
        2015     804
Name: Point, dtype: int64

In [18]:
h_index.swaplevel().sort_index(level=1)

Year  Team
2014  Devils     863
2015  Devils     673
2014  Kings      741
2015  Kings      812
2016  Kings      756
2017  Kings      788
2014  Riders     876
2015  Riders    1479
2016  Riders     694
2014  Royals     701
2015  Royals     804
Name: Point, dtype: int64

In [19]:
h_index.sort_values()

Team    Year
Devils  2015     673
Riders  2016     694
Royals  2014     701
Kings   2014     741
        2016     756
        2017     788
Royals  2015     804
Kings   2015     812
Devils  2014     863
Riders  2014     876
        2015    1479
Name: Point, dtype: int64

In [20]:
h_index.sum(level=0)

Team
Devils    1536
Kings     3097
Riders    3049
Royals    1505
Name: Point, dtype: int64

In [21]:
h_index.sum(level=1)

Year
2014    3181
2015    3768
2016    1450
2017     788
Name: Point, dtype: int64

### Groupby - grouped

In [23]:
grouped = df.groupby("Team")

In [24]:
grouped

In [25]:
list(grouped)

[('Devils',
       Team  Rank  Year  Point
  2  Devils     2  2014    863
  3  Devils     3  2015    673),
 ('Kings',
      Team  Rank  Year  Point
  4  Kings     3  2014    741
  5  Kings     4  2015    812
  6  Kings     1  2016    756
  7  Kings     1  2017    788),
 ('Riders',
        Team  Rank  Year  Point
  0   Riders     1  2014    876
  1   Riders     2  2015    789
  8   Riders     2  2016    694
  11  Riders     2  2015    690),
 ('Royals',
        Team  Rank  Year  Point
  9   Royals     4  2014    701
  10  Royals     1  2015    804)]

In [26]:
for name, group in grouped:
    print(name)
    print(group)

Devils
     Team  Rank  Year  Point
2  Devils     2  2014    863
3  Devils     3  2015    673
Kings
    Team  Rank  Year  Point
4  Kings     3  2014    741
5  Kings     4  2015    812
6  Kings     1  2016    756
7  Kings     1  2017    788
Riders
      Team  Rank  Year  Point
0   Riders     1  2014    876
1   Riders     2  2015    789
8   Riders     2  2016    694
11  Riders     2  2015    690
Royals
      Team  Rank  Year  Point
9   Royals     4  2014    701
10  Royals     1  2015    804

In [27]:
type(group)

pandas.core.frame.DataFrame

In [28]:
grouped.get_group("Devils")

     Team  Rank  Year  Point
2  Devils     2  2014    863
3  Devils     3  2015    673

In [29]:
# aggregation
grouped.agg(sum)

        Rank  Year  Point
Team
Devils     5  4029   1536
Kings      9  8062   3097
Riders     7  8060   3049
Royals     5  4029   1505

In [30]:
import numpy as np
grouped.agg(np.mean)

        Rank    Year   Point
Team
Devils  2.50  2014.5  768.00
Kings   2.25  2015.5  774.25
Riders  1.75  2015.0  762.25
Royals  2.50  2014.5  752.50

In [31]:
grouped["Point"].agg([np.sum, np.mean, np.std])

         sum    mean         std
Team
Devils  1536  768.00  134.350288
Kings   3097  774.25   31.899582
Riders  3049  762.25   88.567771
Royals  1505  752.50   72.831998

In [32]:
grouped.agg(max)

        Rank  Year  Point
Team
Devils     3  2015    863
Kings      4  2017    812
Riders     2  2016    876
Royals     4  2015    804

In [33]:
grouped.describe().T

Team              Devils        Kings       Riders       Royals
Rank  count     2.000000     4.000000     4.000000     2.000000
      mean      2.500000     2.250000     1.750000     2.500000
      std       0.707107     1.500000     0.500000     2.121320
      min       2.000000     1.000000     1.000000     1.000000
      25%       2.250000     1.000000     1.750000     1.750000
      50%       2.500000     2.000000     2.000000     2.500000
      75%       2.750000     3.250000     2.000000     3.250000
      max       3.000000     4.000000     2.000000     4.000000
Year  count     2.000000     4.000000     4.000000     2.000000
      mean   2014.500000  2015.500000  2015.000000  2014.500000
      std       0.707107     1.290994     0.816497     0.707107
      min    2014.000000  2014.000000  2014.000000  2014.000000
      25%    2014.250000  2014.750000  2014.750000  2014.250000
      50%    2014.500000  2015.500000  2015.000000  2014.500000
      75%    2014.750000  2016.250000  2015.250000  2014.750000
      max    2015.000000  2017.000000  2016.000000  2015.000000
Point count     2.000000     4.000000     4.000000     2.000000
      mean    768.000000   774.250000   762.250000   752.500000
      std     134.350288    31.899582    88.567771    72.831998
      min     673.000000   741.000000   690.000000   701.000000
      25%     720.500000   752.250000   693.000000   726.750000
      50%     768.000000   772.000000   741.500000   752.500000
      75%     815.500000   794.000000   810.750000   778.250000
      max     863.000000   812.000000   876.000000   804.000000

In [34]:
# transformation
df

      Team  Rank  Year  Point
0   Riders     1  2014    876
1   Riders     2  2015    789
2   Devils     2  2014    863
3   Devils     3  2015    673
4    Kings     3  2014    741
5    Kings     4  2015    812
6    Kings     1  2016    756
7    Kings     1  2017    788
8   Riders     2  2016    694
9   Royals     4  2014    701
10  Royals     1  2015    804
11  Riders     2  2015    690

In [35]:
score = lambda x:(x)
grouped.transform(score)

    Rank  Year  Point
0      1  2014    876
1      2  2015    789
2      2  2014    863
3      3  2015    673
4      3  2014    741
5      4  2015    812
6      1  2016    756
7      1  2017    788
8      2  2016    694
9      4  2014    701
10     1  2015    804
11     2  2015    690

In [36]:
score = lambda x:(x.max())
grouped.transform(score)

    Rank  Year  Point
0      2  2016    876
1      2  2016    876
2      3  2015    863
3      3  2015    863
4      4  2017    812
5      4  2017    812
6      4  2017    812
7      4  2017    812
8      2  2016    876
9      4  2015    804
10     4  2015    804
11     2  2016    876

In [37]:
score = lambda x:(x - x.mean()) / x.std()
grouped.transform(score)

        Rank      Year     Point
0  -1.500000 -1.224745  1.284327
1   0.500000  0.000000  0.302029
2  -0.707107 -0.707107  0.707107
3   0.707107  0.707107 -0.707107
4   0.500000 -1.161895 -1.042333
5   1.166667 -0.387298  1.183401
6  -0.833333  0.387298 -0.572108
7  -0.833333  1.161895  0.431040
8   0.500000  1.224745 -0.770596
9   0.707107 -0.707107 -0.707107
10 -0.707107  0.707107  0.707107
11  0.500000  0.000000 -0.815759

In [38]:
# 원래값을 확인하는 방법
grouped.transform(lambda x:x)

    Rank  Year  Point
0      1  2014    876
1      2  2015    789
2      2  2014    863
3      3  2015    673
4      3  2014    741
5      4  2015    812
6      1  2016    756
7      1  2017    788
8      2  2016    694
9      4  2014    701
10     1  2015    804
11     2  2015    690

In [39]:
# min-max normalization
score = lambda x: (x-x.min()) / (x.max()-x.min())
grouped.transform(score)

        Rank      Year     Point
0   0.000000  0.000000  1.000000
1   1.000000  0.500000  0.532258
2   0.000000  0.000000  1.000000
3   1.000000  1.000000  0.000000
4   0.666667  0.000000  0.000000
5   1.000000  0.333333  1.000000
6   0.000000  0.666667  0.211268
7   0.000000  1.000000  0.661972
8   1.000000  1.000000  0.021505
9   1.000000  0.000000  0.000000
10  0.000000  1.000000  1.000000
11  1.000000  0.500000  0.000000

In [40]:
# filter
df.groupby('Team').filter(lambda x:len(x)>=3)

      Team  Rank  Year  Point
0   Riders     1  2014    876
1   Riders     2  2015    789
4    Kings     3  2014    741
5    Kings     4  2015    812
6    Kings     1  2016    756
7    Kings     1  2017    788
8   Riders     2  2016    694
11  Riders     2  2015    690

In [41]:
df.groupby('Team').filter(lambda x: x['Point'].sum() > 1000)

      Team  Rank  Year  Point
0   Riders     1  2014    876
1   Riders     2  2015    789
2   Devils     2  2014    863
3   Devils     3  2015    673
4    Kings     3  2014    741
5    Kings     4  2015    812
6    Kings     1  2016    756
7    Kings     1  2017    788
8   Riders     2  2016    694
9   Royals     4  2014    701
10  Royals     1  2015    804
11  Riders     2  2015    690